---
title: InitialWattageIntensity
classe: Autodesk.Revit.DB.Lighting.InitialWattageIntensity
namespace: Autodesk.Revit.DB.Lighting
eredita: Autodesk.Revit.DB.Lighting.InitialIntensity
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# InitialWattageIntensity

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Efficacy { get; set; }` | `initialWattageIntensity.Efficacy` | Double |
| `Double Wattage { get; set; }` | `initialWattageIntensity.Wattage` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```